/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50733
 Source Host           : localhost:3306
 Source Schema         : re_nhfy

 Target Server Type    : MySQL
 Target Server Version : 50733
 File Encoding         : 65001

 Date: 23/09/2021 18:02:44
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for advice
-- ----------------------------
DROP TABLE IF EXISTS `advice`;
CREATE TABLE `advice`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `content` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of advice
-- ----------------------------

-- ----------------------------
-- Table structure for avatars
-- ----------------------------
DROP TABLE IF EXISTS `avatars`;
CREATE TABLE `avatars`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `url` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of avatars
-- ----------------------------
INSERT INTO `avatars` VALUES (2, '10529', 'http://localhost:3000/images/avatar/bb1aaff4-b927-45cc-9472-e12cedc6462c.jpg', '2021-09-16 11:42:48', '2021-09-16 15:26:39');
INSERT INTO `avatars` VALUES (3, '10531', 'http://localhost:3000/images/avatar/9e5df0e7-e3cd-4283-95e1-c02b066ba7cd.png', '2021-09-16 15:20:50', '2021-09-16 15:23:40');

-- ----------------------------
-- Table structure for categories
-- ----------------------------
DROP TABLE IF EXISTS `categories`;
CREATE TABLE `categories`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `username` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of categories
-- ----------------------------
INSERT INTO `categories` VALUES (1, '医院动态', '农丁安', '2021-08-23 16:27:04', '2021-08-23 16:27:04');
INSERT INTO `categories` VALUES (2, '媒体聚焦', '农丁安', '2021-08-23 16:27:16', '2021-08-23 16:27:16');

-- ----------------------------
-- Table structure for depts
-- ----------------------------
DROP TABLE IF EXISTS `depts`;
CREATE TABLE `depts`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `deptCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `deptName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `deptLeader` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `deptAddr` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `desc` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `level` int(11) NULL DEFAULT NULL,
  `deleteBit` int(11) NULL DEFAULT NULL,
  `createdAt` datetime NULL DEFAULT NULL,
  `updatedAt` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 391 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of depts
-- ----------------------------
INSERT INTO `depts` VALUES (1, '1', '全院', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (2, '2', '门诊科室2', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (3, '4', '住院科室', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (4, '7', '财务部门', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (5, '9', '医技科室', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (6, '11', '药剂部门', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (7, '13', '后勤保障', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (8, '16', '行政部门', '张三', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (9, '18', '其他科室', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (10, '19', '检验科室', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (11, '80', '麻醉科', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (12, '86', '信息中心', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (13, '87', '住院结算中心', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (14, '88', '医保科', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (15, '93', '放射科', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (16, '121', '家庭病床', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (17, '125', '出纳组', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (18, '126', '记帐组', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (19, '127', '医保组', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (20, '128', '会计组', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (21, '9394', '门诊草药房', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (22, '129', '信息科', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (23, '130', '特优门诊', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (24, '131', '法医门诊', '李四', '门诊二楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (25, '132', '急诊科', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (26, '133', '医疗美容科', '李四', '门诊七楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (27, '134', '门内科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (28, '135', '门外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (29, '136', '门妇科', '李四', '门诊四楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (30, '137', '门耳鼻喉科', '李四', '门诊六楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (31, '138', '门口腔科', '李四', '门诊六楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (32, '139', '皮肤性病科（门诊）', '李四', '门诊四楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (33, '141', '儿童急诊科', '李四', '门诊一楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (34, '143', '感染发热门诊', '李四', '第四住院楼一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (35, '144', '门中医', '李四', '门诊三楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (36, '145', '简易门诊', '王五', '门诊二楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (37, '146', '男性科', '王五', '门诊三楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (38, '147', '同位素核医学科            ', '王五', '九楼（北栋）', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (39, '148', '门诊肿瘤内科', '王五', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (40, '149', '其他科', '王五', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (41, '150', 'X刀中心', '王五', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (42, '152', '普外科二病室(停用)', '王五', '外科楼16楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (43, '156', '骨科一病室', '王五', '外科楼17楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (44, '157', '肿瘤外科一病室(停用)', '王五', '第一住院楼4楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (45, '158', '泌尿外科一病室', '王五', '外科楼22楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (46, '160', '整形外科病室', '王五', '外科楼24楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (47, '161', '神经外科一病室', '王五', '外科楼13楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (48, '162', '妇科一病室', '王五', '外科楼9楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (49, '9395', '监察室', '王五', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (50, '163', '微创外科病室', '王五', '第二住院楼 七楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (51, '165', '神经内科一病室', '王五', '第二住院楼 一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (52, '166', '心内科一病室', '王五', '第二住院楼4楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (53, '167', '消化内科一病室', '王五', '第一住院楼 12楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (54, '168', '呼吸与危重症医学科', '王五', '第一住院楼 七楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (55, '169', '肿瘤内科一病室', '王五', '第一住院楼 六楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (56, '170', '中医科病室', '王五', '第七住院楼 二楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (57, '174', '血液内科病室', '王五', '第一住院楼 九楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (58, '175', '感染科非肝病区', '赵六', '第四住院楼 二楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (59, '176', '儿科一病室', '赵六', '第二住院楼 三楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (60, '177', '眼科病室', '赵六', '外科楼一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (61, '178', '口腔科病室', '赵六', '第六住院楼 一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (62, '179', '耳鼻喉科病室', '赵六', '外科楼21楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (63, '181', '大病互助病室', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (64, '182', '综合病房', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (65, '183', '特殊门诊病室', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (66, '184', '微笑列车病室', '赵六', '第六住院楼一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (67, '185', '放疗科病室', '赵六', '第一住院楼 二楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (68, '186', '测试科（原老干）', '赵六', '第三住院楼 五楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (69, '187', '神经内科二病室(不可用)', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (70, '188', '病室西药房', '赵六', '第一住院楼一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (71, '189', '门诊中药房', '赵六', '门诊一楼大厅东头', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (72, '190', '门诊西药房', '赵六', '门诊一楼大厅西头', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (73, '192', '胃镜室1', '赵六', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (74, '193', '高压氧', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (75, '194', '心电图室', '赵六', '门诊5楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (76, '195', '脑电图', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (77, '197', '婴儿室', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (78, '199', '肾病内科病室', '赵六', '第一住院楼 八楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (79, '202', '脊柱外科一病室', '赵六', '外科楼19楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (80, '204', '临床心理科病室', '赵六', '第一住院楼 六楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (81, '210', '绿色通道病室', '赵六', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (82, '211', '西药库', '赵六', '药剂楼四楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (83, '212', '中药库', '赵六', '药剂楼四楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (84, '214', '新生儿科病室', '赵六', '外科楼六楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (85, '215', '门诊收费处', '赵六', '门诊楼一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (86, '216', '经管办', '赵六', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (87, '217', '后勤保障部', '赵六', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (88, '219', '手术室', '赵六', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (89, '220', '保卫科', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (90, '221', '供应室', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (91, '222', '院务工作部', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (92, '223', '党务工作部', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (93, '224', '人事部', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (94, '225', '医务部', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (95, '226', '护理部', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (96, '227', '审计科', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (97, '228', '科研部', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (98, '230', '病案室', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (99, '231', '图书室', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (100, '232', '感管科', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (101, '233', '老年办', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (102, '234', '工会', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (103, '235', '团委', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (104, '236', '计生办', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (105, '251', '制剂室', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (106, '291', '基建科', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (107, '311', '病理科', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (108, '312', '120急救', '钱七', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (109, '313', '康复科门诊', '钱七', '门诊十二楼C区1217', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (110, '315', '临检室', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (111, '316', '生化室', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (112, '317', '细菌室', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (113, '318', '免疫室', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (114, '319', '血液室', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (115, '320', 'HIV室', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (116, '321', '病理科1', '钱七', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (117, '371', 'X线室', '张磊', '放射科二楼或外科楼负一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (118, '372', 'CT室', '张磊', '放射科一楼或外科楼负一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (119, '373', '磁共振', '张磊', '放射科或外科楼负一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (120, '374', 'DSA室', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (121, '375', '内窥镜室', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (122, '376', '功能科', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (123, '377', '胃镜室', '张磊', '门诊7楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (124, '378', '无痛胃镜室', '张磊', '门诊7楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (125, '379', '肠镜室', '张磊', '门诊7楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (126, '380', '心脏负荷实验室', '张磊', '门诊5楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (127, '381', '动态心电及血压监测室', '张磊', '门诊5楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (128, '383', '红外线乳透室', '张磊', '门诊5楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (129, '384', '脑电图室', '张磊', '门诊5楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (130, '385', '动态脑电图室', '张磊', '门诊5楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (131, '386', '肌电图室', '张磊', '门诊5楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (132, '391', '成人注射室', '张磊', '门诊三楼采血中心', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (133, '392', '小儿注射室', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (134, '393', '市场部', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (135, '395', '质控科', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (136, '396', '输血科', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (137, '397', '汽车队', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (138, '398', '电工班', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (139, '399', '五官科', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (140, '400', '临床研究所', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (141, '401', '内分泌实验室', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (142, '402', '后装机', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (143, '403', '生物光', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (144, '405', '肝病研究中心', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (145, '406', 'SPECT', '张磊', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (146, '411', '脊柱外科二病室', '张磊', '外科楼20楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (147, '412', '普外三病室', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (148, '431', '1', '张磊', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (149, '451', '门化验室', '张磊', '门诊三楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (150, '452', '门办公室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (151, '453', '102室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (152, '454', '门诊日间手术中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (153, '472', '内科支部', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (154, '473', '外科支部', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (155, '491', '门诊肿瘤放疗科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (156, '511', '三基训练室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (157, '531', '门诊肾内科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (158, '533', '门诊血液科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (159, '534', '门诊消化内科', '李四', '门诊七楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (160, '535', '门诊呼吸', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (161, '536', '门诊神经内科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (162, '551', '纪委办公室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (163, '571', '水工班', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (164, '572', '花园', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (165, '574', '污水处理', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (166, '575', '中央空调', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (167, '576', '中心供氧', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (168, '577', '锅炉房', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (169, '591', '碎石室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (170, '611', '绿色通道1', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (171, '612', '离休老干1', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (172, '613', '绿色通道', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (173, '614', '离休老干', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (174, '9196', '医疗辅助中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (175, '9197', '社区医疗服务科', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (176, '9217', '物业公司-学生楼', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (177, '9218', '物业公司-老办公楼', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (178, '9219', '物业公司-综合楼567', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (179, '9220', '物业公司-工会', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (180, '9221', '物业公司-杏林公寓', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (181, '9222', '物业公司-外围', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (182, '9223', '物业公司-太平小区', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (183, '9237', '肿瘤实验室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (184, '9257', '学生食堂', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (185, '9279', '陪护中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (186, '9280', '健康管理中心', '李四', '门诊楼十楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (187, '9281', '中医内科', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (188, '9297', '肛肠门诊', '李四', '门诊五楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (189, '9299', '门诊中医内科', '李四', '门诊三楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (190, '9300', '门诊疼痛科', '李四', '门诊三楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (191, '9301', '急诊儿科1', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (192, '9302', '儿科药房', '李四', '门诊一楼西门', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (193, '9224', '物业公司-电梯', '李四', '第二住院楼 六楼西', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (194, '9303', '血液实验室', '李四', '门诊8楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (195, '9304', '纤支镜室', '李四', '门诊8楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (196, '9305', '肺功能室', '李四', '门诊8楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (197, '9278', '中医肛肠科', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (198, '532', '门诊心血管内科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (199, '9306', '肝病门诊', '李四', '门诊八楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (200, '9307', '中医科病室中药颗粒', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (201, '9308', '财务部', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (202, '9310', '专家门诊', '李四', '门诊五楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (203, '9311', '皮肤管理中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (204, '9312', '急诊药房', '李四', '急诊科一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (205, '9313', '妇科实验室-内分泌', '李四', '门诊四楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (206, '9314', 'ECT', '李四', '门诊9楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (207, '9315', '皮肤性病实验室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (208, '9316', '咽喉镜室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (209, '9317', '血药浓度测定及药物基因检测室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (210, '9318', '内分泌科病室', '李四', '第一住院楼11楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (211, '9319', '普外科一病室(停用)', '李四', '外科楼15楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (212, '9321', '皮肤性病治疗室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (213, '9322', '儿童保健康复科', '李四', '门诊二楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (214, '9323', '职工食堂', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (215, '9324', '皮肤管理中心X', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (216, '9325', '生殖医学中心', '李四', '门诊十三楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (217, '9326', '门诊肿瘤外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (218, '9328', '门诊脊柱外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (219, '9329', '门诊神经外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (220, '9330', '门诊骨外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (221, '9331', '门诊普外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (222, '9332', '门诊烧伤整形外科', '李四', '门诊三楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (223, '9333', '门诊胸心血管外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (224, '9334', '门诊泌尿外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (225, '9335', '门诊呼吸内科', '李四', '门诊八楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (226, '9336', '骨密度室', '李四', '门诊9楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (227, '9337', '医服中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (228, '9338', '电子直肠镜室', '李四', '门诊5楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (229, '9339', '脊柱', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (230, '9340', '创伤骨科', '李四', '外科楼18楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (231, '9341', '碘—131治疗门诊', '李四', '门诊9楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (232, '9343', '腹泻门诊', '李四', '四住院部一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (233, '9344', '儿童急诊科病室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (234, '9345', '针灸按摩中心', '李四', '门诊14楼C区东头', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (235, '9346', '放疗中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (236, '9347', '外科日间门诊', '李四', '门诊三楼C区3012', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (237, '9348', '儿科二病室', '李四', '急诊楼4楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (238, '9349', '骨质疏松门诊', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (239, '9350', '生长发育门诊', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (240, '9351', 'EICU', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (241, '9352', '先心病病室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (242, '9353', '伤口造口专科病房', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (243, '9354', '伤口造口专科', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (244, '140', '临床心理科', '李四', '门诊三楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (245, '9355', '门诊放疗中心', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (246, '9356', '血液净化中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (247, '9357', '众安康管理处', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (248, '9359', '腹腔镜培训基地', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (249, '9360', '物业监管中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (250, '9361', '门诊产科', '李四', '门诊四楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (251, '9362', '神经内科二病室', '李四', '第二住院楼2楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (252, '9363', '神经内科重症监护病房', '李四', '第二住院楼8楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (253, '9364', 'ECT药房', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (254, '9365', '医技支部', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (255, '9366', '科研经费资产', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (256, '9367', '金域检验所', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (257, '79', '手术室(12楼)', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (258, '142', '门眼科', '李四', '门诊六楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (259, '159', '心胸外科病室', '李四', '外科楼12楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (260, '164', 'ICU病室', '李四', '外科楼25楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (261, '180', '皮肤科病室', '李四', '第四住院楼 4楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (262, '191', 'B超室', '李四', '门诊5楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (263, '196', '产房', '李四', '外科楼7楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (264, '218', '微创手术室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (265, '229', '教育培训部', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (266, '292', '设备科', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (267, '351', '激光外科', '李四', '门诊三楼（C区）', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (268, '382', '颅颈血管超声室', '李四', '门诊五楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (269, '394', '计生办1', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (270, '404', '24动态', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (271, '471', '肿瘤防治中心', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (272, '573', '纪委', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (273, '631', '临床药学室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (274, '9277', '医疗美容科病室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (275, '9382', '疼痛科病室', '李四', '急诊楼2楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (276, '9298', '中医肛肠科病室', '李四', '第一住院楼10楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (277, '9309', '门诊儿科', '李四', '门诊一楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (278, '9320', '门诊内分泌科', '李四', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (279, '9327', '门诊激光外科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (280, '9342', '消化内科实验室', '李四', '门诊7楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (281, '9358', '康复科病室', '李四', '第六住院楼2楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (282, '9368', '等级评审办公室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (283, '9369', '外科日间病房', '李四', '急诊楼2楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (284, '9370', '血管通路护理门诊', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (285, '9371', '血管通路护理专科', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (286, '9372', '外科综合门诊', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (287, '9373', '小儿外科门诊', '李四', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (288, '9374', '门诊准分子', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (289, '9375', '泌尿外科二病室', '李四', '外科楼23楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (290, '9376', '心胸血管外科二病区', '李四', '外科楼十二楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (291, '9377', '神经外科二病室', '李四', '外科楼14楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (292, '9378', '妇科二病室', '李四', '外科楼10楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (293, '9379', '疼痛科', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (294, '9380', '心内科三病室', '李四', '第二住院楼6楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (295, '9381', '骨外科三病室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (296, '9383', '儿科重症监护室', '李四', '急诊楼4楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (297, '9384', '肿瘤外科二病室(停用)', '李四', '第一住院楼3楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (298, '9385', '神经外科重症加护病房', '李四', '外科楼13楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (299, '9386', '肿瘤内科二病室', '李四', '第一住院楼 5楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (300, '9387', '妇科实验室-病理', '李四', '门诊四楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (301, '9388', '第一食堂', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (302, '9389', '心内科二病室', '李四', '第二住院楼5楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (303, '9390', '（取消）心内科三病（取消）', '李四', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (304, '9391', '心内科四病室', '李四', '第二住院部7楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (305, '9422', '远程动态心电图室', '李四', '门诊五楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (306, '9392', '风湿免疫科', '李四', '第六住院楼3楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (307, '9393', '男性科实验室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (308, '9396', '消化内科二病室', '李四', '第一住院楼 13楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (309, '9397', '临床营养科', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (310, '9398', '医辅科室', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (311, '9455', '测试用', '李四', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (312, '9399', '职工二食堂', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (313, '9400', '胆道内镜诊疗中心', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (314, '9401', '床旁超声室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (315, '9402', '固定资产清理', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (316, '9403', '感染科肝病区', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (317, '9404', '手足外科', '李航', '第四住院部 四楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (318, '9405', '水电维修班', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (319, '9406', '电梯配电班', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (320, '9407', '中央空调班', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (321, '9408', '锅炉氧气班', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (322, '9409', '综合管理班', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (323, '9410', '门诊肝胆脾胰外科', '李航', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (324, '9411', '门诊胃肠外科', '李航', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (325, '9412', '门诊乳甲外科', '李航', '门诊八楼A区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (326, '9413', '门诊手足外科', '李航', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (327, '9414', '门诊小儿外科', '李航', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (328, '9415', '门诊体表肿块专科', '李航', '门诊三楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (329, '9416', '肝胆脾胰外科', '李航', '外科楼15楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (330, '9417', '胃肠外科一', '李航', '第一住院楼四楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (331, '9418', '胃肠外科二', '李航', '第一住院楼三楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (332, '9419', '乳甲外科', '李航', '外科楼16楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (333, '9420', '水电动力中心', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (334, '9421', '骨科研究中心', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (335, '9423', '风湿免疫实验室', '李航', '门诊8楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (336, '9424', '门诊风湿免疫科', '李航', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (337, '9425', '乳腺室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (338, '9426', '宫腔镜手术室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (339, '9427', '呼吸治疗门诊', '李航', '门诊8楼A区8005', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (340, '9428', '儿童急诊科发热门诊', '李航', '门诊一楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (341, '9429', '绿色通道门诊', '李航', '门诊二楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (342, '9430', '公共科室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (343, '9431', '脊柱微创手术室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (344, '9432', '手足外科手术室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (345, '9433', '大内科', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (346, '9434', '大外科', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (347, '9435', '配电电梯班', '李航', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (348, '9436', '职工保健门诊', '李航', '门诊二楼B区东头', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (349, '9437', '尿控盆底门诊', '李航', '门诊三楼C区3011', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (350, '9438', '肺结节门诊', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (351, '9439', '全科门诊', '李航', '门诊二楼B区东头', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (352, '9440', '999智能化中药房', '李航', '门诊一楼急诊儿科大厅', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (353, '9441', '一方中药颗粒(门诊1楼工商银行旁)', '李航', '门诊1楼工商银行旁', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (354, '9442', '运行管理部', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (355, '9443', '信息装备部', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (356, '9444', '助产士门诊', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (357, '9445', '生殖男科', '李航', '门诊13楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (358, '9446', '肛肠科手术室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (359, '9447', '枫树林学生公寓', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (360, '9448', '妇检实验室', '李航', '门诊四楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (361, '9449', '戒烟门诊', '李航', '门诊二楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (362, '9450', '吞咽言语康复门诊', '李航', '门诊12楼C区1205', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (363, '9451', '心内介入中心', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (364, '9452', '全面质量评价与考核办公室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (365, '9453', '超声影像科', '李航', '门诊5楼C区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (366, '9454', '心理治疗与咨询', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (367, '9456', '特殊感染病房一区', '李航', '第四住院楼 一楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (368, '9457', '特殊感染病房二区', '李航', '第四住院楼 二楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (369, '9458', '特殊感染病房三区', '李航', '第四住院楼 三楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (370, '9459', '测试科室', '李航', NULL, NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (371, '9460', '医技部门', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (372, '9461', '医辅部门', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (373, '9462', '教研室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (374, '9463', '全科医学科', '李航', '急诊楼二楼西头', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (375, '9464', '心衰门诊', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (376, '9709', '脑心健康管理门诊', '李航', '门诊二楼C2022', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (377, '9746', '呼吸内科二病区', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (378, '9726', '金域检验所', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (379, '9727', '金域检验所', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (380, '9728', '全面质量评价与考核办公室', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (381, '9729', '其他部門', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (382, '9730', '肺小结节专病门诊', '李航', '外科楼12楼1234房间', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (383, '9731', '放疗科三病区', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (384, '9732', '放射影像门诊', '李航', '放射科二楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (385, '9733', '住院管理中心', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (386, '9734', '妇科宫腔镜手术室', '李航', '外科7楼', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (387, '9735', '口腔颌面外科', '李航', '门诊六楼B区', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (388, '9747', '肾内科二病区', '李航', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (389, '9748', '疼痛科二病区', '赵敏', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');
INSERT INTO `depts` VALUES (390, '9749', '康复科二病区', '赵敏', ' ', NULL, 1, 0, '2021-08-25 16:17:05', '2021-08-25 16:17:05');

-- ----------------------------
-- Table structure for get2collects
-- ----------------------------
DROP TABLE IF EXISTS `get2collects`;
CREATE TABLE `get2collects`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `PositionId` int(11) NULL DEFAULT NULL,
  `JobSeekerId` int(11) NULL DEFAULT NULL,
  `status` int(3) UNSIGNED NULL DEFAULT NULL COMMENT '是否已经投递了该岗位？1=投递，0=未投递',
  `createdAt` datetime NULL DEFAULT NULL,
  `updatedAt` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of get2collects
-- ----------------------------
INSERT INTO `get2collects` VALUES (7, 4, 1, 1, '2021-09-18 16:00:27', '2021-09-18 16:00:27');
INSERT INTO `get2collects` VALUES (9, 5, 1, 1, '2021-09-18 16:04:46', '2021-09-18 16:15:40');

-- ----------------------------
-- Table structure for jobseekers
-- ----------------------------
DROP TABLE IF EXISTS `jobseekers`;
CREATE TABLE `jobseekers`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `openid` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `username` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `faceimgUrl` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `phone` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `sex` int(11) NULL DEFAULT NULL,
  `age` int(11) NULL DEFAULT NULL,
  `birthday` datetime NULL DEFAULT NULL,
  `nation` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `address` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `degree` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `school` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `professional` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `role` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `loginNum` int(11) NULL DEFAULT NULL,
  `undergraduateTime` datetime NULL DEFAULT NULL,
  `attachmentUrl` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of jobseekers
-- ----------------------------
INSERT INTO `jobseekers` VALUES (1, 'dfuanodui', '张三', '$2b$10$HZFHGZu2WVEhlp7Hne4rzuMA2bCawbQOwIGzd3.wLz1mFb.Wo.mHG', 'http://localhost:3000/jobseekersAvatar/9b97f7d5-fcde-48da-b1c5-99b37899785f.jpg', '19127761546', 'nda_1992@163.com', 1, 24, '1996-11-02 00:00:00', '汉族', '武汉市', '研究生', '武汉大学', '内科学', 'jobseeker', 12, '2021-06-26 00:00:00', 'http://localhost:3000/jobseekersFiles/18250ced-494d-443d-81e8-99aa6682c544.docx', '2021-09-01 16:34:54', '2021-09-18 15:26:18');
INSERT INTO `jobseekers` VALUES (2, 'openid', '王五', '$2b$10$gnEL1F6jZ19TBwj/XXe2O.hVA9pda0dmKCH6ItaRgRx.McTp1vnHy', 'http://localhost:3000/jobseekersAvatar/default.jpg', '18547213567', 'wangwu@163.com', 2, 23, '1998-07-08 00:00:00', '汉族', '沈阳市', '研究生', '东北大学', '心血管内科', 'jobseeker', 2, '2021-06-30 00:00:00', 'http://localhost:3000/jobseekersFiles/c553e860-39cc-424d-b151-1b67e99f1ea6.docx', '2021-09-09 16:43:12', '2021-09-10 08:25:50');
INSERT INTO `jobseekers` VALUES (3, 'openid', '张晓', '$2b$10$XrNxH8odaoSrTLaCp3Ls5uQcTZHho0Yq/1cUa9ZaG9ewU9cT6OKgK', 'http://localhost:3000/jobseekersAvatar/default.jpg', '17347462356', 'zhangxiao@126.com', 2, 28, '1993-10-13 00:00:00', '汉族', '长沙市', '博士', '湖南大学', '口腔科', 'jobseeker', 4, '2021-09-01 00:00:00', 'http://localhost:3000/jobseekersFiles/26a22a5d-605f-427e-90f6-199d8e7de3af.docx', '2021-09-10 09:17:43', '2021-09-14 15:19:38');

-- ----------------------------
-- Table structure for medicalreformtable
-- ----------------------------
DROP TABLE IF EXISTS `medicalreformtable`;
CREATE TABLE `medicalreformtable`  (
  `统计时间` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `医疗服务收入占比` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `百元医疗支出` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `百元消耗卫生材料` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `资产负债率` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `负债占总资产比例` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `收支是否平衡` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `平均住院日` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门急诊人均费用增长比例` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院人均费用增长比例` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of medicalreformtable
-- ----------------------------

-- ----------------------------
-- Table structure for messages
-- ----------------------------
DROP TABLE IF EXISTS `messages`;
CREATE TABLE `messages`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `send_id` int(11) NULL DEFAULT NULL,
  `receive_id` int(11) NULL DEFAULT NULL,
  `send_date` datetime NULL DEFAULT NULL,
  `read_date` datetime NULL DEFAULT NULL,
  `is_read` int(11) NULL DEFAULT NULL,
  `content` mediumtext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `remove_receive_id` int(11) NULL DEFAULT NULL,
  `remove_send_id` int(11) NULL DEFAULT NULL,
  `replycontent` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 15 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of messages
-- ----------------------------
INSERT INTO `messages` VALUES (1, 10529, 1, '2021-09-09 10:23:08', '2021-09-16 10:57:12', 1, '同学们好😁', '2021-09-09 10:23:08', '2021-09-16 10:57:12', 0, 0, NULL);
INSERT INTO `messages` VALUES (2, 10529, 1, '2021-09-09 10:23:08', '2021-09-16 10:57:12', 1, '同学们好😁', '2021-09-09 10:23:08', '2021-09-16 10:57:24', 1, 10529, NULL);
INSERT INTO `messages` VALUES (3, 10529, 1, '2021-09-09 16:22:52', '2021-09-16 10:57:12', 1, '欢迎你的到来😉', '2021-09-09 16:22:52', '2021-09-16 10:57:12', 0, 0, NULL);
INSERT INTO `messages` VALUES (4, 10529, 1, '2021-09-09 16:34:24', '2021-09-16 10:57:12', 1, '你的表现很不错💪', '2021-09-09 16:34:24', '2021-09-16 10:57:12', 0, 10529, NULL);
INSERT INTO `messages` VALUES (5, 10529, 3, '2021-09-10 09:59:06', '2021-09-14 15:20:19', 1, '你好，请完善你的简历信息😊', '2021-09-10 09:59:06', '2021-09-14 15:20:19', 3, 0, NULL);
INSERT INTO `messages` VALUES (6, 3, 10529, '2021-09-10 10:05:17', '2021-09-16 11:02:32', 1, '老师你好，已经完善上传新的简历了，请您注意查收😀', '2021-09-10 10:05:17', '2021-09-16 11:02:32', 0, 3, '你好，请完善你的简历信息😊');
INSERT INTO `messages` VALUES (7, 3, 10529, '2021-09-10 10:09:36', '2021-09-16 11:02:32', 1, 'ok😉', '2021-09-10 10:09:36', '2021-09-16 11:02:32', 10529, 3, '你好，请完善你的简历信息😊');
INSERT INTO `messages` VALUES (8, 3, 10529, '2021-09-10 10:55:22', '2021-09-16 11:02:32', 1, '好的，已经更新完毕😘', '2021-09-10 10:55:22', '2021-09-16 11:02:32', 10529, 3, '你好，请完善你的简历信息😊');
INSERT INTO `messages` VALUES (9, 10529, 3, '2021-09-10 11:23:05', '2021-09-14 15:20:19', 1, '好的，收到，谢谢😁', '2021-09-10 11:23:05', '2021-09-14 15:20:19', 3, 10529, NULL);
INSERT INTO `messages` VALUES (10, 10529, 3, '2021-09-10 11:27:20', '2021-09-14 15:20:19', 1, '你今天的表现很不错😛', '2021-09-10 11:27:20', '2021-09-14 15:20:19', 3, 10529, NULL);
INSERT INTO `messages` VALUES (11, 3, 10529, '2021-09-10 15:06:52', '2021-09-16 11:02:32', 1, '好的，admin', '2021-09-10 15:06:52', '2021-09-16 11:02:32', 10529, 3, '你今天的表现很不错😛');
INSERT INTO `messages` VALUES (12, 10529, 3, '2021-09-10 17:26:29', '2021-09-14 15:20:19', 1, '已经收到，谢谢😄', '2021-09-10 17:26:29', '2021-09-14 15:20:19', 3, 0, '好的，已经更新完毕😘');
INSERT INTO `messages` VALUES (13, 10529, 3, '2021-09-10 17:40:10', '2021-09-14 15:20:19', 1, '好的，已经收到哈哈😂', '2021-09-10 17:40:10', '2021-09-14 15:20:19', 3, 0, '老师你好，已经完善上传新的简历了，请您注意查收😀');
INSERT INTO `messages` VALUES (14, 3, 10529, '2021-09-10 17:47:07', '2021-09-16 11:02:32', 1, '请问是什么时候面试呢啊🚓', '2021-09-10 17:47:07', '2021-09-16 11:02:32', 0, 3, '好的，已经收到哈哈😂');

-- ----------------------------
-- Table structure for news
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `content` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `userName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `deptName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createTime` datetime NULL DEFAULT NULL,
  `category` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `status` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `newsStatus` int(11) NULL DEFAULT NULL,
  `type` int(11) NULL DEFAULT NULL,
  `clickNum` int(11) NULL DEFAULT NULL,
  `plateform` int(11) NULL DEFAULT NULL,
  `loginuserCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES (1, 'npm管理工具', '<p>npm管理工具</p>', '张三', '人力资源部', '2021-08-23 16:41:07', '医院动态', 'published', 1, 2, 1, 1, '10529', '2021-08-23 16:41:27', '2021-09-16 11:14:07');
INSERT INTO `news` VALUES (2, 'vite管理工具abc', '<p>vite管理工具</p>', '张三', '人力资源部', '2021-08-23 16:55:28', '医院动态', 'published', 2, 2, 1, 1, '10529', '2021-08-23 16:55:39', '2021-09-16 11:35:21');
INSERT INTO `news` VALUES (3, 'vite管理工具abc', '<p>vite管理工具</p>', '张三', '人力资源部', '2021-08-23 17:01:09', '医院动态', 'published', 1, 2, 1, 1, '10529', '2021-08-23 16:58:01', '2021-08-25 08:08:15');
INSERT INTO `news` VALUES (4, 'react也是一个好工具', '<p>react也是一个好工具</p>', '张三', '人力资源部', '2021-08-23 16:58:59', '媒体聚焦', 'published', 1, 2, 0, 1, '10529', '2021-08-23 16:59:22', '2021-08-23 16:59:50');
INSERT INTO `news` VALUES (5, 'JavaScript是一门很不错的语言', '<p>JavaScript是一门很不错的语言</p>', '张三', '护理部', '2021-08-23 18:23:13', '医院动态', 'published', 2, 2, 0, 1, '10529', '2021-08-23 18:23:32', '2021-08-23 18:23:32');
INSERT INTO `news` VALUES (6, 'JavaScript是一门很不错的语言', '<p>JavaScript是一门很不错的语言</p>', '张三', '护理部', '2021-08-24 15:36:09', '医院动态', 'published', 2, 2, 0, 1, '10529', '2021-08-23 18:23:37', '2021-08-24 15:36:09');
INSERT INTO `news` VALUES (7, 'ES7的重要知识点', '<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 20%;\">a</td>\n<td style=\"width: 20%;\">b</td>\n<td style=\"width: 20%;\">c</td>\n<td style=\"width: 20%;\">d</td>\n<td style=\"width: 20%;\">e</td>\n</tr>\n<tr>\n<td style=\"width: 20%;\">1</td>\n<td style=\"width: 20%;\">2</td>\n<td style=\"width: 20%;\">3</td>\n<td style=\"width: 20%;\">4</td>\n<td style=\"width: 20%;\">5</td>\n</tr>\n</tbody>\n</table>\n<p><span style=\"color: #000000;\"><img class=\"wscnph\" src=\"http://localhost:3000/images/news/bbd4cd25-00f3-48ba-92d3-6fbb87046fec.png\" width=\"450\" /></span></p>\n<p><span style=\"color: #000000;\"><a class=\"wscnph\" style=\"color: #000000; text-decoration: underline;\" href=\"http://localhost:3000/files/b5b40aa0-ef32-4af8-aef3-f2cb56ab5edb.xlsx\">绩效考核表格.xlsx</a></span></p>\n<p><span style=\"color: #000000;\"><a class=\"wscnph\" style=\"color: #000000; text-decoration: underline;\" href=\"http://localhost:3000/files/4ea7f357-d6f1-4058-a590-a2ff9e18db18.doc\">签到表 .doc</a></span></p>', '张三', '人力资源部', '2021-08-24 09:35:13', '医院动态', 'published', 2, 2, 2, 1, '10529', '2021-08-24 09:39:50', '2021-08-24 15:09:14');
INSERT INTO `news` VALUES (8, '前端富文本编辑器tinymce', '<p><span style=\"font-size: 18pt;\"><strong>tinymce是一款较为优秀的web端编辑工具</strong></span></p>\n<ol>\n<li><span style=\"font-size: 10pt;\">与vue相结合</span></li>\n<li><span style=\"font-size: 10pt;\">与react结合</span></li>\n</ol>\n<table style=\"height: 50px; width: 500px; border-collapse: collapse;\" border=\"1\" cellspacing=\"5\" cellpadding=\"5\">\n<tbody>\n<tr>\n<td style=\"width: 50%; text-align: center;\">表头1</td>\n<td style=\"width: 50%; text-align: center;\">表头2</td>\n</tr>\n<tr>\n<td style=\"width: 50%; text-align: center;\">abc</td>\n<td style=\"width: 50%; text-align: center;\">123</td>\n</tr>\n</tbody>\n</table>\n<p>&nbsp;</p>\n<p><img class=\"wscnph\" style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"http://localhost:3000/images/news/2992aebe-0c39-4dab-b68b-07c211fa0745.png\" width=\"500\" /></p>\n<p style=\"text-align: center;\">图片1</p>\n<p style=\"text-align: left;\"><a style=\"text-decoration: none;\" href=\"http://localhost:3000/files/de2a5aa8-9bae-4516-8d72-4b8a85c7ccd9.doc\">签到表 .doc</a></p>\n<p style=\"text-align: left;\"><a style=\"text-decoration: none;\" href=\"http://localhost:3000/files/96628fc5-6610-417c-8cce-7c68eae099f0.xlsx\">查看的科室.xlsx</a></p>\n<p style=\"text-align: left;\"><a style=\"text-decoration: none;\" href=\"http://localhost:3000/files/5d9e4d7d-23a6-4d1c-9ace-210a482290b6.xlsx\">6.10肝胆胰外科.xlsx</a><br /><br /><br /></p>', '张三', '人力资源部', '2021-08-24 15:39:56', '医院动态', 'published', 2, 2, 1, 1, '10529', '2021-08-24 15:45:27', '2021-08-24 15:45:50');
INSERT INTO `news` VALUES (9, 'webpack打包工具', '<p>webpack打包工具</p>', '张三', '护理部', '2021-08-25 11:50:30', '医院动态', 'draft', 4, 1, 0, 1, '10529', '2021-08-25 11:50:48', '2021-08-25 11:50:48');

-- ----------------------------
-- Table structure for positions
-- ----------------------------
DROP TABLE IF EXISTS `positions`;
CREATE TABLE `positions`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `positionName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `deptName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `address` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `requireNum` int(11) NULL DEFAULT NULL,
  `type` int(11) NULL DEFAULT NULL,
  `userCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `age` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `degree` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `english` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `professional` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Handlestatus` int(11) NULL DEFAULT NULL,
  `status` int(11) NULL DEFAULT NULL,
  `desc` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `contactPhone` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 15 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of positions
-- ----------------------------
INSERT INTO `positions` VALUES (1, '医师', '人力资源部', '南华大学附属第一医院', 2, 1, '10529', '32岁以下', '研究生及以上', '英语六级', '内科学', 2, 1, '医师', '2021-08-28 15:34:51', '2021-08-28 17:31:32', '0734-8279005');
INSERT INTO `positions` VALUES (3, '医师', '院务工作部', '南华大学附属第一医院', 3, 1, '10263', '30岁及以下', '硕士研究生及以上', '英语四级', '神经外科', 2, 1, '医师', '2021-08-28 16:45:18', '2021-08-28 17:54:29', '0734-8279005');
INSERT INTO `positions` VALUES (4, '副主任医师', '党务工作部', '综合楼517', 1, 2, '12356', '32岁及以下', '硕士研究生及以上', '英语六级', '耳鼻喉科', 2, 1, '副主任医师', '2021-08-28 17:55:29', '2021-08-28 18:03:55', '0734-8279005');
INSERT INTO `positions` VALUES (5, '技师', '教育培训部', '综合楼612', 1, 2, '10529', '32岁及以下', '硕士研究生及以上', '英语六级', '中医科', 2, 1, '教育培训部岗位', '2021-08-28 20:44:16', '2021-09-02 18:12:07', '0734-8279005');
INSERT INTO `positions` VALUES (6, '管理', '院务工作部', '综合楼722', 1, 2, '10529', '30岁及以下', '硕士研究生及以上', '英语六级', '计算机相关专业', 2, 1, '法学专业', '2021-08-28 20:47:04', '2021-09-02 18:12:11', '0734-8279005');
INSERT INTO `positions` VALUES (7, '技师', '科研部', '综合楼608', 1, 2, '10529', '32岁及以下', '硕士研究生及以上', '英语四级', '临床医学', 2, 1, '临床医学', '2021-08-28 21:49:07', '2021-09-02 18:12:13', '0734-8279005');
INSERT INTO `positions` VALUES (8, '临床心理医学科医师', '医务部', '综合楼513', 2, 1, '10529', '32岁及以下', '博士', '英语六级', '临床心理医学科', 2, 1, '临床心理医学科', '2021-08-28 21:51:14', '2021-09-09 16:57:51', '0734-8279005');
INSERT INTO `positions` VALUES (9, '医师', '财务部', '综合楼526', 1, 1, '10529', '35岁及以下', '博士', '英语六级', '病理学', 2, 1, '病理学', '2021-08-28 21:52:14', '2021-09-09 16:57:54', '0734-8279005');
INSERT INTO `positions` VALUES (10, '医疗美容科技师', '财务部', '综合楼532', 2, 2, '10529', '32岁及以下', '硕士研究生及以上', '英语四级', '医疗美容科技师', 2, 1, '医疗美容科技师', '2021-08-28 21:53:00', '2021-09-09 16:58:06', '0734-8279005');
INSERT INTO `positions` VALUES (11, '门诊口腔科', '规划建设科', '综合楼622', 1, 1, '10529', '32岁及以下', '博士', '英语六级', '门诊口腔科', 2, 1, '门诊口腔科', '2021-08-28 21:53:59', '2021-09-09 16:58:09', '0734-8279005');
INSERT INTO `positions` VALUES (12, '眼科医师', '数据中心', '综合楼804', 1, 1, '10529', '35岁及以下', '博士', '英语六级', '门诊眼科', 1, 2, '门诊眼科', '2021-08-28 21:55:00', '2021-09-17 15:53:13', '0734-8279005');
INSERT INTO `positions` VALUES (13, '心血管内科医师', '门诊心血管内科', '住院部', 1, 1, '10529', '35岁及以下', '博士', '英语六级', '内科学相关专业', 2, 1, '医师', '2021-09-10 09:44:30', '2021-09-10 09:44:50', '0734-8279123');
INSERT INTO `positions` VALUES (14, '医师', '门诊神经内科', '南华大学附属第一医院', 4, 2, '10529', '32岁及以下', '硕士研究生及以上', '英语六级', '内科学', 3, 1, '基础学历为一本以上', '2021-09-17 15:52:06', '2021-09-17 15:52:29', '0734-8279555');

-- ----------------------------
-- Table structure for post2positions
-- ----------------------------
DROP TABLE IF EXISTS `post2positions`;
CREATE TABLE `post2positions`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `status` int(11) NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `jobSeekerId` int(11) NULL DEFAULT NULL,
  `PositionId` int(11) NULL DEFAULT NULL,
  `isPosted` int(3) NULL DEFAULT NULL,
  `confirm` int(3) NULL DEFAULT NULL,
  `approveDate` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `post2positions_PositionId_jobSeekerId_unique`(`jobSeekerId`, `PositionId`) USING BTREE,
  INDEX `PositionId`(`PositionId`) USING BTREE,
  CONSTRAINT `post2positions_ibfk_1` FOREIGN KEY (`jobSeekerId`) REFERENCES `jobseekers` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `post2positions_ibfk_2` FOREIGN KEY (`PositionId`) REFERENCES `positions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of post2positions
-- ----------------------------
INSERT INTO `post2positions` VALUES (1, 4, '2021-09-09 09:00:00', '2021-09-09 17:22:51', 1, 4, 1, 1, '2021-09-09 14:22:51');
INSERT INTO `post2positions` VALUES (2, 2, '2021-09-09 09:00:04', '2021-09-10 08:35:13', 1, 7, 1, 0, '2021-09-09 09:22:51');
INSERT INTO `post2positions` VALUES (3, 2, '2021-09-09 16:46:35', '2021-09-10 08:35:30', 2, 4, 1, 0, '2021-09-09 17:22:51');
INSERT INTO `post2positions` VALUES (4, 2, '2021-09-10 09:53:48', '2021-09-10 10:04:26', 3, 4, 1, 0, '2021-09-10 10:04:26');
INSERT INTO `post2positions` VALUES (9, 1, '2021-09-18 16:15:40', '2021-09-18 16:15:40', 1, 5, 1, 0, NULL);

-- ----------------------------
-- Table structure for sequelizemeta
-- ----------------------------
DROP TABLE IF EXISTS `sequelizemeta`;
CREATE TABLE `sequelizemeta`  (
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`name`) USING BTREE,
  UNIQUE INDEX `name`(`name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_unicode_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sequelizemeta
-- ----------------------------
INSERT INTO `sequelizemeta` VALUES ('20210813012958-create-user.js');
INSERT INTO `sequelizemeta` VALUES ('20210813013140-create-token.js');
INSERT INTO `sequelizemeta` VALUES ('20210813145553-create-avatar.js');
INSERT INTO `sequelizemeta` VALUES ('20210814071440-create-dept.js');
INSERT INTO `sequelizemeta` VALUES ('20210816143547-create-news.js');
INSERT INTO `sequelizemeta` VALUES ('20210818013127-create-advice.js');
INSERT INTO `sequelizemeta` VALUES ('20210819083515-create-table-title.js');
INSERT INTO `sequelizemeta` VALUES ('20210821032013-create-category.js');
INSERT INTO `sequelizemeta` VALUES ('20210821063827-create-news.js');
INSERT INTO `sequelizemeta` VALUES ('20210823082319-create-news.js');
INSERT INTO `sequelizemeta` VALUES ('20210827144242-create-job-seeker.js');
INSERT INTO `sequelizemeta` VALUES ('20210828020848-create-position.js');
INSERT INTO `sequelizemeta` VALUES ('20210908135633-create-message.js');
INSERT INTO `sequelizemeta` VALUES ('20210911030413-create-swiper.js');

-- ----------------------------
-- Table structure for swipers
-- ----------------------------
DROP TABLE IF EXISTS `swipers`;
CREATE TABLE `swipers`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userCode` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL,
  `url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `status` int(3) NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of swipers
-- ----------------------------
INSERT INTO `swipers` VALUES (1, '10529', 'http://localhost:3000/swipers/f12fbce0-fb37-4c81-8f64-c622ecd30688.jpg', '2021-09-16 09:17:15', '2021-09-16 10:46:10', 1);
INSERT INTO `swipers` VALUES (2, '10529', 'http://localhost:3000/swipers/168bc694-3074-4f88-b49d-6c6348dae529.jpg', '2021-09-16 10:46:02', '2021-09-16 10:46:13', 1);
INSERT INTO `swipers` VALUES (3, '10529', 'http://localhost:3000/swipers/87cc796a-d83d-4168-8158-bb913f13510e.png', '2021-09-16 10:56:16', '2021-09-16 10:56:20', 1);

-- ----------------------------
-- Table structure for tabletitles
-- ----------------------------
DROP TABLE IF EXISTS `tabletitles`;
CREATE TABLE `tabletitles`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `desc` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 22 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of tabletitles
-- ----------------------------
INSERT INTO `tabletitles` VALUES (17, '全市公立医院综合改革真抓实干督查激励考核定量指标完成情况表', '每月20号前完成填写，使用今年所有月份累计的数据', '2021-08-20 01:39:51', '2021-08-20 01:39:51');
INSERT INTO `tabletitles` VALUES (18, '2021年省级试点医院医药收入构成监测月报表', '填写上一个月的数据，药品和卫生材料的比重相对于医疗总收入来计算', '2021-08-20 01:55:39', '2021-08-20 01:55:39');
INSERT INTO `tabletitles` VALUES (19, '湖南省三级医院法治建设调查表格', '涉及：职工人数、2014年以来的门急诊人次、住院人次、业务收入等', '2021-08-20 02:22:26', '2021-08-20 02:22:26');
INSERT INTO `tabletitles` VALUES (20, '公立医院经济运行情况调查表', '门急诊人次、出入院人数、病床使用率、实际开放和占用总床日数等', '2021-08-20 02:51:02', '2021-08-20 02:51:02');
INSERT INTO `tabletitles` VALUES (21, NULL, NULL, '2021-09-03 16:31:11', '2021-09-03 16:31:11');

-- ----------------------------
-- Table structure for tokens
-- ----------------------------
DROP TABLE IF EXISTS `tokens`;
CREATE TABLE `tokens`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `user_token` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 120 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of tokens
-- ----------------------------
INSERT INTO `tokens` VALUES (43, '10529', 'token', '2021-08-13 08:25:08', '2021-08-13 08:25:08');
INSERT INTO `tokens` VALUES (44, '10529', 'token', '2021-08-13 08:29:03', '2021-08-13 08:29:03');
INSERT INTO `tokens` VALUES (45, '10529', 'token', '2021-08-13 08:31:52', '2021-08-13 08:31:52');
INSERT INTO `tokens` VALUES (46, '10529', 'token', '2021-08-13 08:37:45', '2021-08-13 08:37:45');
INSERT INTO `tokens` VALUES (47, '10529', 'token', '2021-08-13 09:01:48', '2021-08-13 09:01:48');
INSERT INTO `tokens` VALUES (48, '10529', 'token', '2021-08-13 09:05:04', '2021-08-13 09:05:04');
INSERT INTO `tokens` VALUES (49, '10529', 'token', '2021-08-13 09:05:56', '2021-08-13 09:05:56');
INSERT INTO `tokens` VALUES (50, '10529', 'token', '2021-08-13 09:07:38', '2021-08-13 09:07:38');
INSERT INTO `tokens` VALUES (51, '10529', 'token', '2021-08-13 09:08:05', '2021-08-13 09:08:05');
INSERT INTO `tokens` VALUES (52, '10529', 'token', '2021-08-13 09:08:35', '2021-08-13 09:08:35');
INSERT INTO `tokens` VALUES (53, '10529', 'token', '2021-08-13 09:09:05', '2021-08-13 09:09:05');
INSERT INTO `tokens` VALUES (54, '10529', 'token', '2021-08-13 09:10:07', '2021-08-13 09:10:07');
INSERT INTO `tokens` VALUES (55, '10529', 'token', '2021-08-13 09:10:15', '2021-08-13 09:10:15');
INSERT INTO `tokens` VALUES (56, '10529', 'token', '2021-08-13 09:16:37', '2021-08-13 09:16:37');
INSERT INTO `tokens` VALUES (57, '10529', 'token', '2021-08-13 09:23:23', '2021-08-13 09:23:23');
INSERT INTO `tokens` VALUES (58, '10529', 'token', '2021-08-16 00:56:12', '2021-08-16 00:56:12');
INSERT INTO `tokens` VALUES (59, '10529', 'token', '2021-08-16 00:58:32', '2021-08-16 00:58:32');
INSERT INTO `tokens` VALUES (60, '10529', 'token', '2021-08-16 00:59:43', '2021-08-16 00:59:43');
INSERT INTO `tokens` VALUES (61, '10529', 'token', '2021-08-16 01:00:40', '2021-08-16 01:00:40');
INSERT INTO `tokens` VALUES (62, '10529', 'token', '2021-08-17 09:30:45', '2021-08-17 09:30:45');
INSERT INTO `tokens` VALUES (63, '10529', 'token', '2021-08-17 09:31:03', '2021-08-17 09:31:03');
INSERT INTO `tokens` VALUES (64, '10529', 'token', '2021-08-17 09:31:16', '2021-08-17 09:31:16');
INSERT INTO `tokens` VALUES (65, '10529', 'token', '2021-08-17 09:33:46', '2021-08-17 09:33:46');
INSERT INTO `tokens` VALUES (66, '10528', 'token', '2021-08-17 09:40:39', '2021-08-17 09:40:39');
INSERT INTO `tokens` VALUES (67, '10529', 'token', '2021-08-18 00:25:33', '2021-08-18 00:25:33');
INSERT INTO `tokens` VALUES (68, '10528', 'token', '2021-08-18 00:25:42', '2021-08-18 00:25:42');
INSERT INTO `tokens` VALUES (69, '10528', 'token', '2021-08-18 00:46:41', '2021-08-18 00:46:41');
INSERT INTO `tokens` VALUES (70, '10528', 'token', '2021-08-18 00:51:21', '2021-08-18 00:51:21');
INSERT INTO `tokens` VALUES (71, '10528', 'token', '2021-08-18 00:54:07', '2021-08-18 00:54:07');
INSERT INTO `tokens` VALUES (72, '10528', 'token', '2021-08-18 00:54:57', '2021-08-18 00:54:57');
INSERT INTO `tokens` VALUES (73, '10528', 'token', '2021-08-18 01:42:38', '2021-08-18 01:42:38');
INSERT INTO `tokens` VALUES (74, '10529', 'token', '2021-08-19 02:40:08', '2021-08-19 02:40:08');
INSERT INTO `tokens` VALUES (75, '10529', 'token', '2021-08-19 02:44:03', '2021-08-19 02:44:03');
INSERT INTO `tokens` VALUES (76, '10529', 'token', '2021-08-23 16:16:06', '2021-08-23 16:16:06');
INSERT INTO `tokens` VALUES (77, '10529', 'token', '2021-08-23 16:17:50', '2021-08-23 16:17:50');
INSERT INTO `tokens` VALUES (78, '10529', 'token', '2021-08-23 16:24:05', '2021-08-23 16:24:05');
INSERT INTO `tokens` VALUES (79, '10529', 'token', '2021-08-23 18:22:34', '2021-08-23 18:22:34');
INSERT INTO `tokens` VALUES (80, '10529', 'token', '2021-08-24 08:27:18', '2021-08-24 08:27:18');
INSERT INTO `tokens` VALUES (81, '10528', 'token', '2021-08-24 15:51:56', '2021-08-24 15:51:56');
INSERT INTO `tokens` VALUES (82, '10529', 'token', '2021-08-24 15:54:32', '2021-08-24 15:54:32');
INSERT INTO `tokens` VALUES (83, '10529', 'token', '2021-08-24 15:55:23', '2021-08-24 15:55:23');
INSERT INTO `tokens` VALUES (84, '10529', 'token', '2021-08-25 08:05:07', '2021-08-25 08:05:07');
INSERT INTO `tokens` VALUES (85, '10529', 'token', '2021-08-25 08:06:09', '2021-08-25 08:06:09');
INSERT INTO `tokens` VALUES (86, '10529', 'token', '2021-08-26 10:05:53', '2021-08-26 10:05:53');
INSERT INTO `tokens` VALUES (87, '10529', 'token', '2021-08-27 08:34:15', '2021-08-27 08:34:15');
INSERT INTO `tokens` VALUES (88, '10529', 'token', '2021-09-01 16:39:56', '2021-09-01 16:39:56');
INSERT INTO `tokens` VALUES (89, '10529', 'token', '2021-09-02 09:25:48', '2021-09-02 09:25:48');
INSERT INTO `tokens` VALUES (90, '10529', 'token', '2021-09-03 08:23:17', '2021-09-03 08:23:17');
INSERT INTO `tokens` VALUES (91, '10529', 'token', '2021-09-09 08:44:11', '2021-09-09 08:44:11');
INSERT INTO `tokens` VALUES (92, '10529', 'token', '2021-09-10 09:43:05', '2021-09-10 09:43:05');
INSERT INTO `tokens` VALUES (93, '10529', 'token', '2021-09-10 09:54:02', '2021-09-10 09:54:02');
INSERT INTO `tokens` VALUES (94, '10529', 'token', '2021-09-14 15:13:11', '2021-09-14 15:13:11');
INSERT INTO `tokens` VALUES (95, '10529', 'token', '2021-09-16 10:55:38', '2021-09-16 10:55:38');
INSERT INTO `tokens` VALUES (96, '10529', 'token', '2021-09-16 11:36:29', '2021-09-16 11:36:29');
INSERT INTO `tokens` VALUES (97, '10529', 'token', '2021-09-16 11:39:04', '2021-09-16 11:39:04');
INSERT INTO `tokens` VALUES (98, '10529', 'token', '2021-09-16 11:42:33', '2021-09-16 11:42:33');
INSERT INTO `tokens` VALUES (99, '10529', 'token', '2021-09-16 11:43:49', '2021-09-16 11:43:49');
INSERT INTO `tokens` VALUES (100, '10531', 'token', '2021-09-16 15:21:47', '2021-09-16 15:21:47');
INSERT INTO `tokens` VALUES (101, '10529', 'token', '2021-09-16 15:39:30', '2021-09-16 15:39:30');
INSERT INTO `tokens` VALUES (102, '10529', 'token', '2021-09-17 15:34:18', '2021-09-17 15:34:18');
INSERT INTO `tokens` VALUES (103, '10529', 'token', '2021-09-17 15:36:49', '2021-09-17 15:36:49');
INSERT INTO `tokens` VALUES (104, '10529', 'token', '2021-09-17 15:42:12', '2021-09-17 15:42:12');
INSERT INTO `tokens` VALUES (105, '10529', 'token', '2021-09-18 11:03:49', '2021-09-18 11:03:49');
INSERT INTO `tokens` VALUES (106, '10529', 'token', '2021-09-18 11:32:47', '2021-09-18 11:32:47');
INSERT INTO `tokens` VALUES (107, '10529', 'token', '2021-09-23 09:41:17', '2021-09-23 09:41:17');
INSERT INTO `tokens` VALUES (108, '10529', 'token', '2021-09-23 09:42:07', '2021-09-23 09:42:07');
INSERT INTO `tokens` VALUES (109, '10529', 'token', '2021-09-23 10:46:44', '2021-09-23 10:46:44');
INSERT INTO `tokens` VALUES (110, '10529', 'token', '2021-09-23 10:46:59', '2021-09-23 10:46:59');
INSERT INTO `tokens` VALUES (111, '10529', 'token', '2021-09-23 10:47:09', '2021-09-23 10:47:09');
INSERT INTO `tokens` VALUES (112, '10529', 'token', '2021-09-23 10:47:10', '2021-09-23 10:47:10');
INSERT INTO `tokens` VALUES (113, '10529', 'token', '2021-09-23 10:49:06', '2021-09-23 10:49:06');
INSERT INTO `tokens` VALUES (114, '10529', 'token', '2021-09-23 15:21:29', '2021-09-23 15:21:29');
INSERT INTO `tokens` VALUES (115, '10529', 'token', '2021-09-23 15:21:38', '2021-09-23 15:21:38');
INSERT INTO `tokens` VALUES (116, '10529', 'token', '2021-09-23 15:28:53', '2021-09-23 15:28:53');
INSERT INTO `tokens` VALUES (117, '10529', 'token', '2021-09-23 15:31:49', '2021-09-23 15:31:49');
INSERT INTO `tokens` VALUES (118, '10529', 'token', '2021-09-23 15:33:26', '2021-09-23 15:33:26');
INSERT INTO `tokens` VALUES (119, '10529', 'token', '2021-09-23 15:35:16', '2021-09-23 15:35:16');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `username` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `role` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `deptCode` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `desc` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `loginNum` int(11) NULL DEFAULT NULL,
  `createdAt` datetime NOT NULL,
  `updatedAt` datetime NOT NULL,
  `status` int(2) NULL DEFAULT NULL COMMENT '当前用户状态，0=审核未通过，1=审核已通过；2=已注销',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES (1, '10529', '农丁安', '$2b$10$iOpuUXR944Fnfzjyrg6.ye1nURtek4JtUywAdsasWYKfBB1C1xyhW', 'nongdingan@126.com', 'admin', '102', NULL, 110, '2021-08-13 01:39:47', '2021-09-23 17:50:37', 1);
INSERT INTO `users` VALUES (2, '10528', '张三', '$2b$10$u5PzGKp8DV4Vpj12PvfXmuAzkY1hLI1RnmyfVVjXw5R570IuUfjwm', 'zhangsan@163.com', 'common', '101', NULL, 8, '2021-08-17 09:40:29', '2021-09-23 17:50:43', 0);
INSERT INTO `users` VALUES (4, '10531', '李磊', '$2b$10$l6UPdOUT95JHZiFdZEcvKufNqwK4OrKyWlHnGINIzQfkFQf.Z2AnO', 'lilei@126.com', 'common', '心内科一病室', NULL, 1, '2021-09-16 15:20:50', '2021-09-23 17:55:02', 2);

-- ----------------------------
-- Table structure for web_month_report
-- ----------------------------
DROP TABLE IF EXISTS `web_month_report`;
CREATE TABLE `web_month_report`  (
  `统计时间` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `医疗总收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊医疗总收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊诊察收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊检查收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊化验收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊治疗收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊手术收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊卫生材料收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊高值卫生材料收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊其他卫生材料` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊药品收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊西药收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊中成药收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊中药饮片收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门诊其他收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院医疗总收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院床位收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院诊察收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院检查收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院化验收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院治疗收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院手术收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院护理收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院卫生材料收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院高值耗材收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院其他卫生材料收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院药品收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院西药收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院中成药收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院中药饮片收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院其他收入` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `药占比` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `耗占比` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `门急诊人次` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `急诊人次` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `住院人次` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `平均住院日` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of web_month_report
-- ----------------------------
INSERT INTO `web_month_report` VALUES ('2019-01-01', '203988441.37', '69313771.98', '1700744', '12947836.65', '9135526.7', '5297181', '3360537.2', '2513941.73', '3419.28', '2510522.45', '33145296.7', '24091285.6', '7428858.9', '1625152.2', '1212708', '134674669.39', '2465110.18', '1715620', '11926868.48', '17989928', '17818014.93', '11549245.38', '3844266.44', '27598399.21', '11287841.14', '16310558.07', '38376193.77', '35784365.61', '1151613.72', '1440214.44', '1391023', '33.558825', '22.731965', '114223', '19513', '8321', '9.9');
INSERT INTO `web_month_report` VALUES ('2019-02-01', '179439443.76', '54175605.48', '1267797.12', '11451049.2', '7549396.5', '4123651.26', '2449281.3', '1910820.4', '3442.2', '1907378.2', '24425287.1', '17592680', '5594747.7', '1237859.4', '998322.6', '125263838.28', '1897512', '1330190', '10562707.3', '15666228.5', '14236565.35', '8751086.92', '3167204.62', '22456542.27', '9743744.02', '12712798.25', '31604649.84', '29874510.12', '847106.65', '883033.07', '15591151.48', '30.043029', '19.745126', '88452', '13659', '6395', '8.6');
INSERT INTO `web_month_report` VALUES ('2019-03-01', '211471187.11', '70240833.95', '1608957', '16233850.2', '10078350.1', '4863776.1', '3041831.3', '2399556.36', '157.5', '2399398.86', '30932715.99', '21672606.59', '7343838', '1916271.4', '1081796.9', '141230353.16', '2472717.5', '1803680', '12593602.86', '18599484', '18798772.16', '12359068.14', '3646023.3', '30847224.57', '12726401.41', '18120823.16', '38641845.36', '35898616.8', '1141200.36', '1602028.2', '1467935.27', '31.23653', '23.430283', '121180', '13717', '8483', '9.6');
INSERT INTO `web_month_report` VALUES ('2019-04-01', '212085597.43', '72618614.13', '1738568', '15625626.27', '10503407', '5118232.4', '2937764', '2579732.89', '155.4', '2579577.49', '32959690.97', '23105969.78', '7824689.79', '2029031.4', '1155592.6', '139466983.3', '2388363', '1752975', '12367839.75', '18396855.5', '18562551.94', '12618457.63', '3559774.39', '30423339.63', '12430160.58', '17993179.05', '38158895.48', '35524514.32', '1096760.08', '1537621.08', '1237930.98', '31.851259', '23.411912', '124500', '16182', '8330', '9.5');
INSERT INTO `web_month_report` VALUES ('2019-05-01', '204383238.95', '71471058.02', '1753757', '15573499.65', '10338299.8', '4993406.78', '2738029.5', '2346334.96', '361.2', '2345973.76', '32591012.79', '23331572.58', '7325273.51', '1934166.7', '1136717.54', '132912180.93', '2401124.89', '1712785', '12412743.61', '18361703.5', '17078218.82', '11542040.11', '3472987.97', '26894002.11', '10208875.75', '16685126.36', '37758785.25', '35069483.55', '997526.67', '1691775.03', '1277789.67', '32.646442', '21.815703', '122056', '18661', '8146', '9.4');
INSERT INTO `web_month_report` VALUES ('2019-06-01', '193010926.94', '68353696.12', '1612117.5', '15636113.44', '9303562.5', '5613485.44', '2668742.5', '2208364.9', '139.86', '2208225.04', '30232524.99', '21757708.9', '6667528.09', '1807288', '1078784.85', '124657230.82', '2286102.76', '1607940', '11480493.7', '17272621.5', '16244851.4', '10529401.27', '3320855.65', '24534154.83', '9292645.21', '15241509.62', '35859141.75', '33335017.03', '932854.3', '1591270.42', '1521667.96', '32.481637', '21.070498', '112352', '17688', '7799', '9.4');
INSERT INTO `web_month_report` VALUES ('2019-07-01', '218607739.85', '76304196.63', '1819826', '16140545.54', '10804352.7', '6723829.03', '3796416.4', '2901061.66', '1254.54', '2899807.12', '33102982.98', '23196203.63', '7712568.65', '2194210.7', '1015182.32', '142303543.22', '2589706.07', '1807992', '12730066.09', '19319127.5', '18604584.69', '13665651.18', '3527310.6', '29643265.87', '12024323.45', '17618942.42', '38749409.44', '36017110.42', '1036576.16', '1695722.86', '1666429.78', '31.088771', '22.175906', '128417', '15178', '8746', '9.4');
INSERT INTO `web_month_report` VALUES ('2019-08-01', '199504114.62', '69140607.34', '1606415', '14553724.62', '10013898.1', '5654399.3', '3140324.2', '2679917.98', '8781.78', '2671136.2', '30610232.84', '21491623.41', '7090708.73', '2027900.7', '881695.3', '130363508.78', '2388401.95', '1709844.9', '11782663.21', '18141623', '17334636.68', '12159378.46', '3166495.33', '24882982.21', '9658996.06', '15223986.15', '37202933.9', '34605238.47', '973102.37', '1624593.06', '1594549.14', '32.160075', '20.929988', '116901', '12109', '8278', '9.3');
INSERT INTO `web_month_report` VALUES ('2019-09-01', '188340437.52', '64016782.99', '1500335.5', '14493883.29', '8829602', '4902884.7', '2642873.3', '2150369.47', '0', '2150369.47', '28746755.01', '20170637.19', '6496925.92', '2079191.9', '750079.72', '124323654.48', '2213602.75', '1579203.5', '10880377.93', '17244559.5', '16688925.01', '10655243.62', '2912963.79', '26199264.1', '11699619.67', '14499644.43', '34552351.52', '31888771.24', '966661.22', '1696919.06', '1397162.76', '31.603938', '22.67221', '120604', '15570', '7971', '9.5');
INSERT INTO `web_month_report` VALUES ('2019-10-01', '191945258.07', '66884218.76', '1619755', '16305061.2', '9284782.4', '4950246.5', '2897179.1', '2315112.1', '0', '2315112.1', '28698409.86', '20059378.81', '6355586.25', '2283444.8', '813672.6', '125061039.33', '2258305.53', '1605943.98', '11292687.16', '17887341', '16500464.19', '11326034.18', '2988051.35', '24799432.73', '9830917.63', '14968515.1', '35028319.11', '32422267.62', '930361.69', '1675689.8', '1374460.1', '31.137833', '21.147135', '124405', '16083', '7471', '9.2');
INSERT INTO `web_month_report` VALUES ('2019-11-01', '184062335.35', '61889002.51', '1209868.8', '15496686.1', '8567380.7', '4962805.04', '2725610.39', '2142875.4', '2509.08', '2140366.32', '26010802.96', '18620232.86', '4434402.6', '2956167.5', '772973.12', '122173332.8', '2194513.25', '1573345', '10971157.8', '17783971.5', '16386460.8', '11280458.44', '2933001.55', '25221172.94', '10784989.43', '14436183.51', '32315999.63', '29805789.6', '731714.51', '1778495.52', '1513251.89', '29.116299', '21.763178', '118241', '14992', '7565', '9.2');
INSERT INTO `web_month_report` VALUES ('2019-12-01', '190878659.46', '68337255.54', '1240681.8', '22156709.3', '8501612.7', '5081131.19', '2725368.8', '1961020.81', '0', '1961020.81', '25834913.33', '18286466.07', '3982630.16', '3565817.1', '835817.61', '122541403.08', '2275115.55', '1603789.55', '11457638.4', '18809588.5', '17334973.32', '10701205.83', '3068809.03', '23706565.21', '10258040.91', '13448524.3', '31893892.27', '29161063.11', '681203.28', '2051625.88', '1689825.42', '27.30078', '19.277217', '117581', '16799', '7936', '9.7');
INSERT INTO `web_month_report` VALUES ('2020-01-01', '160865895.32', '54059519.98', '1080148.5', '11244925.15', '7799981.4', '4573757.1', '3079516.1', '2076875.42', '0', '2076875.42', '23431237.51', '16751083.05', '3867067.96', '2813086.5', '773078.8', '106806375.34', '1932098.02', '1326306', '9454249.06', '15936285', '15376001.39', '8893892.47', '3034915.2', '20024550.07', '8463289.77', '11561260.3', '29267889.3', '27121911.73', '674467.75', '1471509.82', '1560188.83', '30.096206', '20.432732', '101263', '19461', '7489', '8.9');
INSERT INTO `web_month_report` VALUES ('2020-02-01', '71371818.67', '16296806.33', '193624', '3484045.7', '1978577.8', '2061968.3', '292273.2', '369361.4', '358.2', '369003.2', '7581520.03', '5964532.81', '1040250.42', '576736.8', '335435.9', '55075012.4', '1065794.45', '619024', '5276728.9', '8361997.5', '7407624.11', '2909799.1', '1616069.25', '10433063.58', '5464228.44', '4968835.14', '16464133.51', '15532276.96', '301398.99', '630457.56', '920778', '31.999268', '22.825481', '24735', '7098', '2789', '10.1');
INSERT INTO `web_month_report` VALUES ('2020-03-01', '159202110.23', '49852952.76', '666090.3', '12425717.51', '7647252.8', '3918484.94', '2724276.7', '1724409.36', '45', '1724364.36', '20132991.25', '13333415.69', '3970044.96', '2829530.6', '613729.9', '109349157.46', '2003433.4', '1336436', '10407607.52', '16192413.5', '15647460.62', '10089621.98', '2429185.35', '22697758.76', '10287142.93', '12410615.83', '27175202.82', '25298580.59', '699609.28', '1177012.95', '1370037.51', '27.199169', '21.826181', '92584', '6797', '5553', '8.9');
INSERT INTO `web_month_report` VALUES ('2020-04-01', '199305780.09', '65842881.93', '916637.5', '16859941.5', '10037971.5', '5493208', '4420733.1', '2604870.7', '45', '2604825.7', '24769517.13', '15959323.13', '5061361.3', '3748832.7', '740002.5', '133462898.16', '2230600.2', '1624707', '12569948.85', '19368070', '18657545.24', '13854913.26', '2796225.13', '28624618.46', '12135386.17', '16489232.29', '32480449.67', '29826470.97', '792670.99', '1861307.71', '1255820.35', '25.909849', '21.983957', '122063', '7416', '7746', '9.5');
INSERT INTO `web_month_report` VALUES ('2020-05-01', '198376477.62', '62037120.19', '1009253.45', '16524178.54', '9753733.09', '5729808.16', '3435499.43', '2703040.02', '4185.29', '2698854.73', '22126659.87', '13767919.07', '4759950.73', '3598790.07', '754947.63', '136339357.53', '2377963.35', '1687580', '13621351.67', '20285297.47', '19698668.75', '12433023.11', '2923627.25', '27247836.7', '11708521.28', '15539315.42', '33733343.62', '30718245.55', '838308.08', '2176789.99', '2330665.61', '25.247158', '21.01573', '124209', '11307', '7680', '9.2');
INSERT INTO `web_month_report` VALUES ('2020-06-01', '197416845.9', '64584019.8', '1207126', '18057674.31', '9890863.45', '6363606.52', '3414095', '2834907.45', '7588.89', '2827318.56', '22028039.27', '13136534.62', '4942535.87', '3948968.78', '787707.8', '132832826.1', '2292567.05', '1624439', '13093736.14', '20111848.5', '19198519.45', '11961675.57', '2825819.85', '26928570.2', '11370685.48', '15557884.72', '33254320.42', '29738638.04', '846874.97', '2668807.41', '1541329.92', '24.650674', '20.940363', '125626', '10066', '8083', '9.3');
INSERT INTO `web_month_report` VALUES ('2020-07-01', '213352273.12', '71125082.31', '1070267.8', '18657484.66', '10327974.5', '8447456.21', '4254797.12', '3487859.07', '4854.42', '3483004.65', '24067138.4', '14636073.84', '5118683.55', '4312381.01', '812104.55', '142227192.42', '2384011.5', '1726846.5', '14103191.06', '21171979.5', '19864017.9', '13560083.07', '2974651.6', '29551143.77', '11438907.07', '18112236.7', '35363382.45', '31799663.03', '796412.26', '2767307.16', '1527885.07', '24.537274', '21.464804', '134416', '10388', '8275', '8.9');
INSERT INTO `web_month_report` VALUES ('2020-08-01', '218161490.03', '71889068.31', '1061390', '13240522.79', '6205572', '5145675.62', '2713835.69', '2102937', '7745.04', '2095191.96', '40799617.51', '35397401.12', '2969198.79', '2433017.6', '619517.7', '146272421.72', '2423806.1', '1703516', '13806140.17', '20552312.5', '20148506.77', '13739411.33', '3092788', '31958156.63', '12293667.2', '19664489.43', '36873593.6', '33045226.55', '952337.21', '2876029.84', '1974190.62', '33.169999', '24.244794', '137774', '10938', '8531', '8.9');
INSERT INTO `web_month_report` VALUES ('2020-09-01', '209264545.62', '71381368', '3299886.05', '25372006.29', '14967119.48', '9340359.85', '5579800.3', '4894603.87', '6289.05', '4888314.82', '6884634.32', '-6801783.88', '7087665.35', '6598752.85', '1042957.84', '137883177.61', '2272008.3', '1454144', '13532992.17', '19692521', '19157906.39', '12591920.43', '3050787.65', '29873297.49', '6169106.82', '23704190.67', '35277089.99', '31537314.21', '889553.99', '2850221.79', '980510.19', '15.632247', '20.806292', '114825', '10751', '8177', '9');
INSERT INTO `web_month_report` VALUES ('2020-10-01', '202817793.03', '62905855.63', '2296686.9', '17936186.2', '10266395.75', '6834193.99', '3438934.99', '2808003.66', '6679.68', '2801323.98', '18333475.08', '9286398.21', '4832761.37', '4214315.5', '991979.06', '139911937.25', '2387222.05', '2339915', '13963234.89', '21276529.5', '18999585.82', '11886498.31', '4172550.39', '29540150.75', '13179558.46', '16360592.29', '35931379.59', '32573214.6', '922782.26', '2435382.73', '-585129.05', '23.476814', '21.775506', '118819', '12621', '7732', '8.8');
INSERT INTO `web_month_report` VALUES ('2020-11-01', '217792642.1', '67840349.47', '2242423.3', '20408626.4', '10050078.75', '6336720.2', '3539592', '2747818.44', '7030.29', '2740788.15', '21618593.07', '13753518.64', '5428796.73', '2436277.7', '896497.31', '149952292.79', '2498957', '2313117', '14062079.65', '21220476', '19970157.99', '13557481.16', '4159404.45', '34025547.01', '15870220.5', '18155326.51', '37288004.25', '34344600.94', '1053425.67', '1889977.64', '857068.28', '25.66', '23.14449', '116008', '10382', '8210', '8.8');
INSERT INTO `web_month_report` VALUES ('2020-12-01', '234355265.5', '73140895.19', '1964426.42', '19348209.95', '10229747', '6184657.6', '2271450.61', '2927234.1', '0', '2927234.1', '24751852.6', '17812600.9', '5228423.94', '1710827.76', '5463316.91', '161214372.12', '2565072', '2375851', '14696202.7', '21875239.5', '21662441.16', '13802515.84', '4359320.65', '37047507.13', '16101180.39', '20946326.74', '39695458.09', '37295069.55', '1017181.78', '1383206.76', '3134764.05', '25.47', '23.527292', '110262', '9681', '8296', '9');
INSERT INTO `web_month_report` VALUES ('2021-01-01', '233830132.22', '70690877.87', '1971588.77', '9533440.47', '9997010.5', '7244517.24', '3222247.98', '3802997.93', '0', '3802997.93', '26502819.08', '19223790.42', '5667098.71', '1611929.95', '8416255.9', '163139254.35', '2658279.7', '2494982.49', '15237252.4', '23371259.25', '21853075.81', '14166670.06', '4637941.18', '35416629.24', '14349656.51', '21066972.73', '40964372.81', '38514390.47', '1103061.75', '1346920.59', '2338791.41', '26.5', '23.574738', '123423', '10370', '8316', '8.9');
INSERT INTO `web_month_report` VALUES ('2021-02-01', '188854093.41', '59275785.59', '1583492.94', '5444184.31', '5042982', '5744271.9', '2857741.45', '3354860.94', '129166.28', '3225694.66', '21588934.05', '15358890.19', '4798107.94', '1431935.92', '13659318', '129578307.79', '1903281', '1838550.5', '11972737.45', '18815127.5', '16513585.45', '10717350.3', '3566477.68', '28550826.86', '12182190.14', '16368636.72', '34615605.58', '32389988.45', '854409.76', '1371207.37', '1084765.47', '27.03', '24.052616', '107609', '8593', '7145', '8.2');
INSERT INTO `web_month_report` VALUES ('2021-03-01', '260358828.3', '81280702.64', '2146539.53', '21398495.11', '12474387.9', '7168080.18', '3176794.94', '3709706.72', '362270.57', '3347436.15', '29118230.29', '19953377.06', '6882675.57', '2282177.66', '2088537.97', '179078125.65', '2695348.5', '2656614.05', '16328358.69', '24697132.5', '23062069.81', '16833719.49', '4561214.97', '42231894.8', '18600978.57', '23630916.23', '44092719.47', '40919499.18', '1300649.9', '1872570.39', '1919053.37', '25.39', '24.548289', '137643', '8821', '9418', '8.7');
INSERT INTO `web_month_report` VALUES ('2021-04-01', '247141818.95', '80315585.78', '2229403.36', '20732392.11', '12020960.93', '6987893.43', '3041910.23', '3371189.63', '370980.15', '3000209.48', '29890122.68', '20679678.03', '6649886.18', '2560558.47', '2041713.41', '166826233.17', '2532342.8', '2490183', '15355704.8', '23417099', '21222710.93', '14968186.78', '4397965', '38422284.4', '15833762.88', '22588521.52', '42561030.87', '39322731.73', '1203476.19', '2034822.95', '1458725.59', '25.39', '23.924274', '136256', '11268', '9082', '8.8');
INSERT INTO `web_month_report` VALUES ('2021-05-01', '237858429.07', '76956981.96', '2210875.18', '18687344.55', '12304205.98', '7010860.25', '2592618.74', '3291512.87', '308103.64', '2983409.23', '28857420.83', '20352174.04', '6009861.11', '2495385.68', '2002073.56', '160901447.06', '2572092.5', '2510786.2', '15484925.4', '23095514.5', '20186405.44', '13873689.28', '4407401.9', '35760991.02', '14517558.07', '21243432.95', '41262071.46', '37522492.02', '1194223.46', '2545355.98', '1747569.36', '26.16', '23.281717', '134529', '12769', '8862', '8.678515');
INSERT INTO `web_month_report` VALUES ('2021-06-01', '208895658.75', '75497205.51', '2104676.53', '17586698.65', '12108399.5', '8398080.2', '2584817.76', '3755695.35', '349932.82', '3405762.53', '27149594.1', '19069208.08', '5595998.26', '2484387.76', '1809243.42', '133398453.24', '2174130.5', '2058652', '11944887.76', '18587441', '17576030.1', '12256580.29', '3736485.34', '30592025.11', '11344118.98', '19247906.13', '33388447.06', '30815147.15', '995329.9', '1577970.01', '1083774.08', '25.97', '23.151976', '130381', '10978', '7748', '9.3');
INSERT INTO `web_month_report` VALUES ('2021-07-01', '228670812.87', '93326679.21', '2561254.06', '21862225.81', '14065131.5', '10847956.72', '6222785.96', '6162930.4', '280234.42', '5882695.98', '31037971.76', '21226182.31', '6376073.28', '3435716.17', '566423', '135344133.66', '2280022.5', '2202228', '12312455.85', '17877111', '18748696.02', '14722130.08', '3659814.68', '32129912.34', '9129314.37', '23000597.97', '30191252.43', '27622681.37', '727590.84', '1840980.22', '1220510.76', '23.57', '22.869374', '152514', '10276', '7454', '8.6');

SET FOREIGN_KEY_CHECKS = 1;
